{"keras_version": "2.2.0", "backend": "tensorflow", "class_name": "Model", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "config": {"sparse": false, "name": "input_1", "dtype": "float32", "batch_input_shape": [null, 1, 48, 48]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "conv2d_1", "config": {"kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "data_format": "channels_first", "bias_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "activation": "relu", "name": "conv2d_1", "filters": 32, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dilation_rate": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "dropout_1", "config": {"name": "dropout_1", "trainable": true, "noise_shape": null, "rate": 0.2, "seed": null}, "class_name": "Dropout", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "conv2d_2", "config": {"kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "data_format": "channels_first", "bias_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "activation": "relu", "name": "conv2d_2", "filters": 32, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dilation_rate": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "config": {"pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "conv2d_3", "config": {"kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "data_format": "channels_first", "bias_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "activation": "relu", "name": "conv2d_3", "filters": 64, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dilation_rate": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "dropout_2", "config": {"name": "dropout_2", "trainable": true, "noise_shape": null, "rate": 0.2, "seed": null}, "class_name": "Dropout", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "conv2d_4", "config": {"kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "data_format": "channels_first", "bias_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "activation": "relu", "name": "conv2d_4", "filters": 64, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dilation_rate": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "config": {"pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "conv2d_5", "config": {"kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "data_format": "channels_first", "bias_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "activation": "relu", "name": "conv2d_5", "filters": 128, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dilation_rate": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "dropout_3", "config": {"name": "dropout_3", "trainable": true, "noise_shape": null, "rate": 0.2, "seed": null}, "class_name": "Dropout", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "conv2d_6", "config": {"kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "data_format": "channels_first", "bias_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "activation": "relu", "name": "conv2d_6", "filters": 128, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dilation_rate": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"name": "up_sampling2d_1", "config": {"name": "up_sampling2d_1", "size": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "concatenate_1", "config": {"name": "concatenate_1", "trainable": true, "axis": 1}, "class_name": "Concatenate", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["up_sampling2d_1", 0, 0, {}]]]}, {"name": "conv2d_7", "config": {"kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "data_format": "channels_first", "bias_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "activation": "relu", "name": "conv2d_7", "filters": 64, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dilation_rate": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "dropout_4", "config": {"name": "dropout_4", "trainable": true, "noise_shape": null, "rate": 0.2, "seed": null}, "class_name": "Dropout", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "conv2d_8", "config": {"kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "data_format": "channels_first", "bias_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "activation": "relu", "name": "conv2d_8", "filters": 64, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dilation_rate": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"name": "up_sampling2d_2", "config": {"name": "up_sampling2d_2", "size": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "concatenate_2", "config": {"name": "concatenate_2", "trainable": true, "axis": 1}, "class_name": "Concatenate", "inbound_nodes": [[["conv2d_2", 0, 0, {}], ["up_sampling2d_2", 0, 0, {}]]]}, {"name": "conv2d_9", "config": {"kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "data_format": "channels_first", "bias_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "activation": "relu", "name": "conv2d_9", "filters": 32, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dilation_rate": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"name": "dropout_5", "config": {"name": "dropout_5", "trainable": true, "noise_shape": null, "rate": 0.2, "seed": null}, "class_name": "Dropout", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"name": "conv2d_10", "config": {"kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "data_format": "channels_first", "bias_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "activation": "relu", "name": "conv2d_10", "filters": 32, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dilation_rate": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"name": "conv2d_11", "config": {"kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "data_format": "channels_first", "bias_constraint": null, "activity_regularizer": null, "kernel_size": [1, 1], "use_bias": true, "bias_regularizer": null, "activation": "relu", "name": "conv2d_11", "filters": 2, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dilation_rate": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"name": "reshape_1", "config": {"name": "reshape_1", "trainable": true, "target_shape": [2, 2304]}, "class_name": "Reshape", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"name": "permute_1", "config": {"name": "permute_1", "dims": [2, 1], "trainable": true}, "class_name": "Permute", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"name": "activation_1", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "class_name": "Activation", "inbound_nodes": [[["permute_1", 0, 0, {}]]]}], "output_layers": [["activation_1", 0, 0]]}}