{"config": {"layers": [{"config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 1, 48, 48]}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"trainable": true, "data_format": "channels_first", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "use_bias": true, "name": "conv2d_1", "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "activation": "relu", "kernel_regularizer": null}, "name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"rate": 0.2, "name": "dropout_1", "seed": null, "trainable": true, "noise_shape": null}, "name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"config": {"trainable": true, "data_format": "channels_first", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "use_bias": true, "name": "conv2d_2", "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "activation": "relu", "kernel_regularizer": null}, "name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true}, "name": "max_pooling2d_1", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"config": {"trainable": true, "data_format": "channels_first", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "use_bias": true, "name": "conv2d_3", "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "activation": "relu", "kernel_regularizer": null}, "name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"config": {"rate": 0.2, "name": "dropout_2", "seed": null, "trainable": true, "noise_shape": null}, "name": "dropout_2", "class_name": "Dropout", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"config": {"trainable": true, "data_format": "channels_first", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "use_bias": true, "name": "conv2d_4", "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "activation": "relu", "kernel_regularizer": null}, "name": "conv2d_4", "class_name": "Conv2D", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2], "trainable": true}, "name": "max_pooling2d_2", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"config": {"trainable": true, "data_format": "channels_first", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "use_bias": true, "name": "conv2d_5", "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "activation": "relu", "kernel_regularizer": null}, "name": "conv2d_5", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"config": {"rate": 0.2, "name": "dropout_3", "seed": null, "trainable": true, "noise_shape": null}, "name": "dropout_3", "class_name": "Dropout", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"config": {"trainable": true, "data_format": "channels_first", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "use_bias": true, "name": "conv2d_6", "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "activation": "relu", "kernel_regularizer": null}, "name": "conv2d_6", "class_name": "Conv2D", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"config": {"name": "up_sampling2d_1", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "name": "up_sampling2d_1", "class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"config": {"axis": 1, "name": "concatenate_1", "trainable": true}, "name": "concatenate_1", "class_name": "Concatenate", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["up_sampling2d_1", 0, 0, {}]]]}, {"config": {"trainable": true, "data_format": "channels_first", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "use_bias": true, "name": "conv2d_7", "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "activation": "relu", "kernel_regularizer": null}, "name": "conv2d_7", "class_name": "Conv2D", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"config": {"rate": 0.2, "name": "dropout_4", "seed": null, "trainable": true, "noise_shape": null}, "name": "dropout_4", "class_name": "Dropout", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"config": {"trainable": true, "data_format": "channels_first", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "use_bias": true, "name": "conv2d_8", "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "activation": "relu", "kernel_regularizer": null}, "name": "conv2d_8", "class_name": "Conv2D", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"config": {"name": "up_sampling2d_2", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "name": "up_sampling2d_2", "class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"config": {"axis": 1, "name": "concatenate_2", "trainable": true}, "name": "concatenate_2", "class_name": "Concatenate", "inbound_nodes": [[["conv2d_2", 0, 0, {}], ["up_sampling2d_2", 0, 0, {}]]]}, {"config": {"trainable": true, "data_format": "channels_first", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "use_bias": true, "name": "conv2d_9", "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "activation": "relu", "kernel_regularizer": null}, "name": "conv2d_9", "class_name": "Conv2D", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"config": {"rate": 0.2, "name": "dropout_5", "seed": null, "trainable": true, "noise_shape": null}, "name": "dropout_5", "class_name": "Dropout", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"config": {"trainable": true, "data_format": "channels_first", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "use_bias": true, "name": "conv2d_10", "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "activation": "relu", "kernel_regularizer": null}, "name": "conv2d_10", "class_name": "Conv2D", "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"config": {"trainable": true, "data_format": "channels_first", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 2, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "use_bias": true, "name": "conv2d_11", "strides": [1, 1], "kernel_constraint": null, "kernel_size": [1, 1], "activation": "relu", "kernel_regularizer": null}, "name": "conv2d_11", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"config": {"target_shape": [2, 2304], "name": "reshape_1", "trainable": true}, "name": "reshape_1", "class_name": "Reshape", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"config": {"name": "permute_1", "trainable": true, "dims": [2, 1]}, "name": "permute_1", "class_name": "Permute", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "name": "activation_1", "class_name": "Activation", "inbound_nodes": [[["permute_1", 0, 0, {}]]]}], "name": "model_1", "output_layers": [["activation_1", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.0"}