{"keras_version": "2.2.0", "class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["activation_1", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 1, 48, 48], "dtype": "float32", "name": "input_1"}, "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "filters": 32, "name": "conv2d_1", "use_bias": true, "trainable": true, "bias_regularizer": null, "padding": "same", "strides": [1, 1], "data_format": "channels_first", "kernel_constraint": null, "activation": "relu"}, "name": "conv2d_1"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Dropout", "config": {"rate": 0.2, "seed": null, "trainable": true, "noise_shape": null, "name": "dropout_1"}, "name": "dropout_1"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "filters": 32, "name": "conv2d_2", "use_bias": true, "trainable": true, "bias_regularizer": null, "padding": "same", "strides": [1, 1], "data_format": "channels_first", "kernel_constraint": null, "activation": "relu"}, "name": "conv2d_2"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1"}, "name": "max_pooling2d_1"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "filters": 64, "name": "conv2d_3", "use_bias": true, "trainable": true, "bias_regularizer": null, "padding": "same", "strides": [1, 1], "data_format": "channels_first", "kernel_constraint": null, "activation": "relu"}, "name": "conv2d_3"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Dropout", "config": {"rate": 0.2, "seed": null, "trainable": true, "noise_shape": null, "name": "dropout_2"}, "name": "dropout_2"}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "filters": 64, "name": "conv2d_4", "use_bias": true, "trainable": true, "bias_regularizer": null, "padding": "same", "strides": [1, 1], "data_format": "channels_first", "kernel_constraint": null, "activation": "relu"}, "name": "conv2d_4"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2"}, "name": "max_pooling2d_2"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "filters": 128, "name": "conv2d_5", "use_bias": true, "trainable": true, "bias_regularizer": null, "padding": "same", "strides": [1, 1], "data_format": "channels_first", "kernel_constraint": null, "activation": "relu"}, "name": "conv2d_5"}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "Dropout", "config": {"rate": 0.2, "seed": null, "trainable": true, "noise_shape": null, "name": "dropout_3"}, "name": "dropout_3"}, {"inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "filters": 128, "name": "conv2d_6", "use_bias": true, "trainable": true, "bias_regularizer": null, "padding": "same", "strides": [1, 1], "data_format": "channels_first", "kernel_constraint": null, "activation": "relu"}, "name": "conv2d_6"}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"data_format": "channels_last", "trainable": true, "size": [2, 2], "name": "up_sampling2d_1"}, "name": "up_sampling2d_1"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}], ["up_sampling2d_1", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": 1, "name": "concatenate_1"}, "name": "concatenate_1"}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "filters": 64, "name": "conv2d_7", "use_bias": true, "trainable": true, "bias_regularizer": null, "padding": "same", "strides": [1, 1], "data_format": "channels_first", "kernel_constraint": null, "activation": "relu"}, "name": "conv2d_7"}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "Dropout", "config": {"rate": 0.2, "seed": null, "trainable": true, "noise_shape": null, "name": "dropout_4"}, "name": "dropout_4"}, {"inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "filters": 64, "name": "conv2d_8", "use_bias": true, "trainable": true, "bias_regularizer": null, "padding": "same", "strides": [1, 1], "data_format": "channels_first", "kernel_constraint": null, "activation": "relu"}, "name": "conv2d_8"}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"data_format": "channels_last", "trainable": true, "size": [2, 2], "name": "up_sampling2d_2"}, "name": "up_sampling2d_2"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}], ["up_sampling2d_2", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": 1, "name": "concatenate_2"}, "name": "concatenate_2"}, {"inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "filters": 32, "name": "conv2d_9", "use_bias": true, "trainable": true, "bias_regularizer": null, "padding": "same", "strides": [1, 1], "data_format": "channels_first", "kernel_constraint": null, "activation": "relu"}, "name": "conv2d_9"}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "Dropout", "config": {"rate": 0.2, "seed": null, "trainable": true, "noise_shape": null, "name": "dropout_5"}, "name": "dropout_5"}, {"inbound_nodes": [[["dropout_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "filters": 32, "name": "conv2d_10", "use_bias": true, "trainable": true, "bias_regularizer": null, "padding": "same", "strides": [1, 1], "data_format": "channels_first", "kernel_constraint": null, "activation": "relu"}, "name": "conv2d_10"}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "filters": 2, "name": "conv2d_11", "use_bias": true, "trainable": true, "bias_regularizer": null, "padding": "same", "strides": [1, 1], "data_format": "channels_first", "kernel_constraint": null, "activation": "relu"}, "name": "conv2d_11"}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "Reshape", "config": {"target_shape": [2, 2304], "trainable": true, "name": "reshape_1"}, "name": "reshape_1"}, {"inbound_nodes": [[["reshape_1", 0, 0, {}]]], "class_name": "Permute", "config": {"name": "permute_1", "trainable": true, "dims": [2, 1]}, "name": "permute_1"}, {"inbound_nodes": [[["permute_1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "name": "activation_1"}], "name": "model_1"}, "backend": "tensorflow"}